

import { Component } from "react";
import  '../../../ComponentCss/Category/Lab Info/profDesc.css'


class profDesc extends Component{
   
    render(){
        return(
            <div class='prof' >
                <div>
                    <figure class='photo'>
                        <img src='/data/image/professor.jpg'  alt ='no image'></img>
                    </figure>
                    <table class='profTable' border="1">
                        <tr><td></td></tr>
                        <tr>
                            <td>Name</td><td>이 칠 우</td>
                        </tr>
                        <tr><td></td></tr>
                        <tr>
                            <td>Address</td><td>(500-757) 광주광역시 북구 용봉로 77 전남대학교 공과대학7호관 604호</td>
                        </tr>
                        <tr><td></td></tr>
                        <tr>
                            <td>Tel</td><td>062-530-1803</td>
                        </tr>
                        <tr><td></td></tr>
                        <tr>
                            <td>E-mail</td><td>leecw@jnu.ac.kr</td>
                        </tr>
                        <tr><td></td></tr>
                    </table>
                    <img src='/data/image/LabInfo/titlebar_prof1.jpg'></img>
                    <ul>
                        <li>컴퓨터비전/인터페이스</li>
                        <li>지능형 휴먼인터페이스, 가상현실 정보가전, 응용소프트웨어, 실감형 디지털 콘텐츠 표현 및 제작</li>
                    </ul>
                    <img src='/data/image/LabInfo/titlebar_prof2.jpg'></img>
                    <ul>
                        <li> 이칠우 교수는 1992년 동경대학 대학원 전자공학과에서 박사학위를 취득한 후 첨단 영상미디어 및 인터페이스기술을 개발하는 일본 이미지정보과학연구소에서 수석연구원으로 근무하면서 오사카대학 기초공학부 협력연구원, 리츠메이칸대학 특별초빙강사를 거쳐 1996년부터 전남대학교 전자컴퓨터공학부 교수로 재직 중입니다.
영상 및 신호처리를 기본으로 하여 정보시스템과 인간과의 지능적인 정보전달이 가능한 휴먼인터페이스, 즉 지능형인터페이스 구현을 목적으로 그래픽스, 인공지능, 센서응용 기술들을 결합하여 지능형 사용자 인터페이스에 의한 상호작용 콘텐츠개발을 지속적으로 수행해 왔습니다. 일본에서 근무하는 동안 국가주도의 휴먼미디어(Human Media) 연구프로젝트에 참여하여 이 부분의 선도적인 연구를 경험하였습니다. 아울러 감성공학에 근간으로 하는 각종 사업 및 연구자들과의 교류를 통해 최근 화제가 되고 있는 UI 및 UX에 대한 많은 경험을 하였습니다.
최근에 들어서는 그동안의 경험을 바탕으로 첨단 UI와 UX에 대해 연구를 진행하고 있으며, 특히 모바일 디바이스의 인터페이스기술 개발에 대한 폭 넓은 연구를 수행하고 있습니다. 그 결과 그 동안의 연구성과를 바탕으로 하여 지경부지원의 대학IT연구센터인 “차세대휴대폰인터페이스연구센터”를 2009년부터 설립하여 관련 연구를 수행하고 있습니다.
대한 전자공학회, 통신학회, 정보과학회, 멀티미디어학회, 로봇학회, 차세대컴퓨팅학회, 한국HCI학회, 스마트미디어학회 회원이며, 전남대학교 문화콘텐츠기술연구소 소장, 차세대휴대폰인터페이스연구소 소장직을 맡고 있습니다.</li>
                    </ul>
                    <img src='/data/image/LabInfo/titlebar_prof3.jpg'></img>
                       <ul>
                        <li>1986년 2월: 중앙대학교 전자공학과 졸업</li>
                        <li>1987년 5월: 포항제철 제철장학회 해외장학생(4기 장학생)</li>
                        <li>1992년 3월: 동경대학 대학원 전자공학과 졸업(공학박사)</li>
                        <li>1992년 4월~1995년 12월: 일본 이미지정보과학연구소 수석연구원</li>
                        <li>1993년 4월~1995년 12월: 오사카대학 기초공학부 협력연구원 및 리츠메이칸대학 정보학부 특별초빙강사</li>
                        <li>1996년 1월~현재: 전남대학교 전자컴퓨터공학부 교수</li>
                        <li>2002년 1월~2003년 2월: 미국 NC A&T State University 방문교수</li>
                        <li>2006년 4월~2008년 3월: 전남대학교 정보통신연구소 소장</li>
                        <li>2006년 3월~2008년 2월: 정보통신부 평가위원</li>
                        <li>2007년 1월~2008년 8월: 전남대학교 산학연구부처장 겸 산학협력부단장</li>
                        <li>2008년 10월~2009년 8월: KAIST 및 오사카대학 초빙교수</li>
                        <li>2006년 3월~현재: 전남대학교 문화콘텐츠기술연구소 소장</li>
                        <li>2009년 3월~현재: 전남대학교 차세대휴대폰인터페이스연구센터(ITRC) 센터장</li>
                        <li>1987년 ~ 현재: 대한전자공학회, 정보과학회, 정보처리학회, 멀티미디어학회, 한국 통신학회 외 평생회원 및 관련분야 이사</li>
                        <li>2001년 2월~2002년 1월: 광주시 영상발전위원회 자문위원</li>
                        <li>2004년 1월~2009년 12월: 광주시 IT융합포럼 운영위원장</li>
                        <li>2004년 8월~2006년 7월: 광주 디지털영상디자인기술지원센터 센터장</li>
                        <li>2006년 3월~현재: 광주정보문화산업진흥원 이사</li>
                        <li>2009년 3월~현재: 광주 아시아문화전당 설계자문위원</li>
                        <li>2011년~현재: 한국문화기술연구원설립준비위원회 위원</li>
                       </ul>
                </div>
            </div>
        );
    }
}

export default profDesc